#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.keycloak_realm.this will be destroyed
  # (because keycloak_realm.this is not in configuration)
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "testing-nk" -> null
      - internal_id                              = "testing-nk" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "testing-nk" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "foi-mod-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "1ec24e63-a51f-4918-9139-a7672ec8449d",
          - "2075ce69-48e3-4795-bdff-12f4cefa51a8",
          - "2082b807-88f3-4568-93f8-fef02145035d",
          - "25f4115d-3e48-49f6-aed2-bbd45bc0ca5a",
          - "28842e0f-2b39-4be3-ad51-aadbe8526a74",
          - "36f9f19f-64be-452c-85a3-2036a33203df",
          - "435bead0-8a48-4697-8954-79dd5684810d",
          - "4de9c672-af7b-4a24-a532-086b0b79aabd",
          - "61c2efc0-1e36-4975-b2a8-cc1b88874e45",
          - "7226c0e4-8abe-4433-9a23-eeffa14c64d9",
          - "72904719-d4dd-4b32-b648-ba49505571f9",
          - "7b4994f5-fff6-4980-9751-d63b450fe11b",
          - "ac0eeff6-8d66-4c3f-b4c0-d97d6419805f",
          - "ae94f6e7-abc6-4e43-89a7-e096d862e9b5",
          - "af5843aa-132b-4d36-8284-4bedfdcd0a5b",
          - "f4cabc27-1423-4ec6-9043-71eb77dd066c",
          - "f6e61e6d-d3c9-45f4-bde5-8b8468eda8cd",
          - "fa934ddd-4b40-4020-b8bb-31cc2d64258c",
        ] -> (known after apply)
        id              = "804c4503-1997-46f4-bdf2-52de99c3fccc"
        name            = "foi-mod-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin_master.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "4b1c0fb4-c8b7-4217-9936-2e6512d26e42" -> null
      - name       = "testing-nk Realm Administrator" -> null
      - path       = "/testing-nk Realm Administrator" -> null
      - realm_id   = "master" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin_master.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "4b1c0fb4-c8b7-4217-9936-2e6512d26e42" -> null
      - id         = "master/4b1c0fb4-c8b7-4217-9936-2e6512d26e42" -> null
      - realm_id   = "master" -> null
      - role_ids   = [
          - "12a6ca34-2ccb-4b7d-b4a3-468a2e5f890c",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin_master.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "testing-nk-realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "11900027-9078-4271-8a0d-1f6b56ece86a" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "testing-nk-realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "master" -> null
      - service_account_user_id                    = "808af028-2184-44d5-a795-2d2dda491d43" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "808af028-2184-44d5-a795-2d2dda491d43/12a6ca34-2ccb-4b7d-b4a3-468a2e5f890c" -> null
      - realm_id                = "master" -> null
      - role                    = "testing-nk-realm-admin" -> null
      - service_account_user_id = "808af028-2184-44d5-a795-2d2dda491d43" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin_master.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "0a6c4a02-35c5-4180-9e8c-d1d3c89ea835",
          - "25202c99-1312-4825-9b4c-e802f9ed30d8",
          - "4394a401-ccb9-4cad-b615-368aea19c1fb",
          - "4ad87d86-a96b-4fdc-b6ee-f970abb31659",
          - "56cf89ff-e6f3-45dc-96fb-780634cd7b3e",
          - "591da2ba-27ef-4001-b56c-c32be606ac90",
          - "63341f0c-441b-412f-932c-1f8f413bccc8",
          - "77f1e6e3-90ae-4272-977f-9d743008b967",
          - "84e1a69f-d5bb-4137-93c1-fc172942c247",
          - "8722cfea-1d77-43e9-8941-483d82ac2329",
          - "9c820f0f-fb0b-4165-9350-44cf9a9231b0",
          - "a9dbf407-9f59-4361-8dda-411e37be3033",
          - "ab3749e5-959d-4db2-916e-adcf9af8159b",
          - "b70b7eaa-2352-42e2-9549-de8b44fdd355",
          - "b839ef1e-2115-45f4-9298-d4c5f4c40a6a",
          - "c72e129f-d71a-4af8-bb57-f049d74e0f55",
          - "f204d8cf-868d-4610-b664-b46483cdeb02",
          - "f5615a9b-4d12-4da7-9309-bddafab9bf69",
        ] -> null
      - id              = "12a6ca34-2ccb-4b7d-b4a3-468a2e5f890c" -> null
      - name            = "testing-nk-realm-admin" -> null
      - realm_id        = "master" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcregistry"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcregistry"
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin.module.realm_admin.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "3e46d73d-a242-42ba-99b3-9f3d3aff7214" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "testing-nk" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "3e46d73d-a242-42ba-99b3-9f3d3aff7214" -> null
      - id         = "testing-nk/3e46d73d-a242-42ba-99b3-9f3d3aff7214" -> null
      - realm_id   = "testing-nk" -> null
      - role_ids   = [
          - "c329c684-a58e-4e2c-9e7b-70cf95d4ff15",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "24ad8f99-929f-4c68-8cab-65378ab75696" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "testing-nk" -> null
      - service_account_user_id                    = "df5ba4c4-5d75-4c92-8d29-bf265f91400f" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "df5ba4c4-5d75-4c92-8d29-bf265f91400f/c329c684-a58e-4e2c-9e7b-70cf95d4ff15" -> null
      - realm_id                = "testing-nk" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "df5ba4c4-5d75-4c92-8d29-bf265f91400f" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_admin.module.realm_admin.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "3e995551-d1c4-4918-a6d0-02a52384c3a0",
        ] -> null
      - id              = "c329c684-a58e-4e2c-9e7b-70cf95d4ff15" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "testing-nk" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_viewer.module.realm_viewer.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "8f9f15d7-5166-4df0-b824-25ce1a9ac4c5" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "testing-nk" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "8f9f15d7-5166-4df0-b824-25ce1a9ac4c5" -> null
      - id         = "testing-nk/8f9f15d7-5166-4df0-b824-25ce1a9ac4c5" -> null
      - realm_id   = "testing-nk" -> null
      - role_ids   = [
          - "a87a0f41-fbb2-4a82-9d69-70067578eb02",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "c53058ac-50c9-46e4-be1b-50c7cf279cdd" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "testing-nk" -> null
      - service_account_user_id                    = "90ce610a-1a31-4ce2-8551-f553034a5fb3" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "90ce610a-1a31-4ce2-8551-f553034a5fb3/a87a0f41-fbb2-4a82-9d69-70067578eb02" -> null
      - realm_id                = "testing-nk" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "90ce610a-1a31-4ce2-8551-f553034a5fb3" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.testing-nk.module.realm_viewer.module.realm_viewer.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "34bca413-3812-47f8-b7c4-739908348b4a",
          - "5e5fcd82-e9cf-404a-bb96-49ecf6b6e975",
          - "827b42c7-1671-43da-97c7-dfb7f4f283f9",
          - "99eadb2f-ca82-480c-9f5d-af4bccb4f344",
          - "bf28d00c-b974-43a2-aee8-9ab47f7d465b",
          - "fbe0da4d-4291-4499-ac3c-da049688e785",
        ] -> null
      - id              = "a87a0f41-fbb2-4a82-9d69-70067578eb02" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "testing-nk" -> null
    }

Plan: 13 to add, 1 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*